//请按要求将问题答案按编号填写于名为   学号_姓名_lab3.doc 并提交 



//====================================================================
//程序1：请查看 a=5指令对应的机器码
//要求：
//1) 请在disassembly window 观察指令的地址，然后在memory窗口观察并，截图 
//====================================================================
/*
#include <stdio.h>

int a;
int main (int argc, char *argv[])
{
	int i; 

	a = 5;
	
    return 0;
}
*/


//====================================================================
//程序2：一个带有算术运算的程序：from SSD6.chm文件的1.5.3.2
//要求： 1）a = b + 3 * c; 对应的汇编代码是什么？
//       2）a = b + 3 * c; 使用了哪几个指令？哪几个寄存器
//====================================================================
/*
#include <stdio.h>

int a;
int b = 4;
int c = 3;

int main ( int argc, char * argv[]) 
{
	printf("\n");
	return 0;
}
*/


//====================================================================
//程序3：一个带有位运算的程序：
//要求：c = a&b; 对应的汇编代码是什么？（注意编译选项不要优化） 
//====================================================================
/*
#include <stdio.h>

int a =4;
int b =5;
int c =0;

int main ( int argc, char * argv[]) 
{

	c = a&b;

	printf("\n");
	return 0;
}
*/


//====================================================================
//程序4：一个带有逻辑运算的程序：
//要求：c = a&&b;; 对应的汇编代码是什么？
//====================================================================
/*
#include <stdio.h>


int a =4;
int b =5;
int c =0;

int main ( int argc, char * argv[]) 
{

	c = a&&b;

  	printf("\n");
	return 0;
}
*/

//====================================================================
//程序5：一个if分支的程序
//要求：1）if语句 对应的汇编代码是什么？
//		2）总结其框架 
//====================================================================
/*
#include <stdio.h>
int a;
int main ( int argc, char * argv[]) 
{

	a = 5;
	
	if (a>0)
	{
		printf("a>0 \n");
	}

  	return 0;
}
*/


//====================================================================
//程序6：一个if-else分支的程序
//要求：1）if-else语句 对应的汇编代码是什么？
//		2）总结其框架
//====================================================================
/*
#include <stdio.h>
int a;
int main ( int argc, char * argv[]) 
{

	a = 5;
	if (a>0)
	{
		printf("a>0 \n");
	}
	else
	{
		printf("a<0 \n");
	}

  	return 0;
}
*


//====================================================================
//程序7：一个switch分支的程序
//要求：1）switch语句 对应的汇编代码是什么？
//		2）结其框架
//====================================================================

#include <stdio.h>

int a;

int main ( int argc, char * argv[]) 
{

	a = 2;
	switch (a)
	{
		case 1:
			a=1;
			break;

		case 2:
			a=2;

		case 3:
			a=3;
			break;

		default:
			a=5;
	}
	
  	return 0;
}
*/




//====================================================================
//程序8：一个while循环的程序
//要求：1）while语句 对应的汇编代码是什么？
//		2）总结其框架
//====================================================================
/*
#include <stdio.h>

int a;

int main ( int argc, char * argv[]) 
{

	int b;
	a = 5;
	
	while(a>0)
	{
		b++;
		a--;
	}

  	return 0;
}
*/

//====================================================================
//程序9：一个do-while循环的程序
//要求：1）do-while 语句对应的汇编代码是什么？
//		2）总结其框架
//====================================================================
/*
#include <stdio.h>

int a;

int main ( int argc, char * argv[]) 
{

	int b;
	a = 5;
	
	do
	{
		b++;
		a--;
	}while(a>0);

  	return 0;

}
*/



//====================================================================
//程序10：一个for循环的程序
//要求：1）for语句 对应的汇编代码是什么？
//		2）总结其框架
//====================================================================
/*
#include <stdio.h>

int a;
int b;

int main ( int argc, char * argv[]) 
{

	b=0;

	for(a=5;a>0;a--)
	{
		b++;
	}

  	return 0;
}
*/

//====================================================================
//程序11：一个函数调用的程序
//要求：1）（从函数的{ 到第一条高级语言前，所有的汇编代码在做什么 
//		2）简单总结函数调用框架，即每个函数调用之初要做些什么工作，函数如何传递，返回值如何传递
//====================================================================
/*
#include <stdio.h>

int add(int x,int y)
{
	int sum = x + y;
	return sum;
}

int main ( ) 
{
	int a=5;
	int b=6;
	int c=0;
	c=add(a,b);
	return 0;
}
*/



